zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC54000/periph4/PERI_VFIFO.h
/*
** ###################################################################
**     Processors:          LPC54101J256BD64
**                          LPC54101J256UK49
**                          LPC54101J512BD64
**                          LPC54101J512UK49
**                          LPC54102J256BD64_cm0plus
**                          LPC54102J256BD64_cm4
**                          LPC54102J256UK49_cm0plus
**                          LPC54102J256UK49_cm4
**                          LPC54102J512BD64_cm0plus
**                          LPC54102J512BD64_cm4
**                          LPC54102J512UK49_cm0plus
**                          LPC54102J512UK49_cm4
**
**     Version:             rev. 1.0, 2016-04-29
**     Build:               b240704
**
**     Abstract:
**         CMSIS Peripheral Access Layer for VFIFO
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2016-04-29)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file VFIFO.h
 * @version 1.0
 * @date 2016-04-29
 * @brief CMSIS Peripheral Access Layer for VFIFO
 *
 * CMSIS Peripheral Access Layer for VFIFO
 */

#if !defined(VFIFO_H_)
#define VFIFO_H_                                 /**< Symbol preventing repeated inclusion */

#if (defined(CPU_LPC54101J256BD64) || defined(CPU_LPC54101J256UK49) || defined(CPU_LPC54101J512BD64) || defined(CPU_LPC54101J512UK49))
#include "LPC54101_COMMON.h"
#elif (defined(CPU_LPC54102J256BD64_cm0plus) || defined(CPU_LPC54102J256UK49_cm0plus) || defined(CPU_LPC54102J512BD64_cm0plus) || defined(CPU_LPC54102J512UK49_cm0plus))
#include "LPC54102_cm0plus_COMMON.h"
#elif (defined(CPU_LPC54102J256BD64_cm4) || defined(CPU_LPC54102J256UK49_cm4) || defined(CPU_LPC54102J512BD64_cm4) || defined(CPU_LPC54102J512UK49_cm4))
#include "LPC54102_cm4_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- VFIFO Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VFIFO_Peripheral_Access_Layer VFIFO Peripheral Access Layer
 * @{
 */

/** VFIFO - Size of Registers Arrays */
#define VFIFO_FIFOCFGUSART_COUNT                  4u
#define VFIFO_FIFOCFGSPI_COUNT                    2u
#define VFIFO_USART_COUNT                         4u
#define VFIFO_SPI_COUNT                           2u

/** VFIFO - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[256];
  __IO uint32_t FIFOCTLUSART;                      /**< USART FIFO global control register. These registers are byte, halfword, and word addressable.The upper 16 bits of these registers provide information about the System FIFO configuration, and are specific to each device type., offset: 0x100 */
  __IO uint32_t FIFOUPDATEUSART;                   /**< USART FIFO global update register, offset: 0x104 */
       uint8_t RESERVED_1[8];
  __IO uint32_t FIFOCFGUSART[VFIFO_FIFOCFGUSART_COUNT]; /**< FIFO configuration register for USART0, array offset: 0x110, array step: 0x4 */
       uint8_t RESERVED_2[224];
  __IO uint32_t FIFOCTLSPI;                        /**< SPI FIFO global control register. These registers are byte, halfword, and word addressable. The upper 16 bits of these registers provide information about the System FIFO configuration, and are specific to each device type., offset: 0x200 */
  __IO uint32_t FIFOUPDATESPI;                     /**< SPI FIFO global update register, offset: 0x204 */
       uint8_t RESERVED_3[8];
  __IO uint32_t FIFOCFGSPI[VFIFO_FIFOCFGSPI_COUNT]; /**< FIFO configuration register for SPI0, array offset: 0x210, array step: 0x4 */
       uint8_t RESERVED_4[3560];
  struct {                                         /* offset: 0x1000, array step: 0x100 */
    __IO uint32_t CFGUSART;                          /**< USART0 configuration, array offset: 0x1000, array step: 0x100 */
    __IO uint32_t STATUSART;                         /**< USART0 status, array offset: 0x1004, array step: 0x100 */
    __IO uint32_t INTSTATUSART;                      /**< USART0 interrupt status, array offset: 0x1008, array step: 0x100 */
    __IO uint32_t CTLSETUSART;                       /**< USART0 control read and set register. A complete value may be read from this register. Writing a 1 to any implemented bit position causes that bit to be set., array offset: 0x100C, array step: 0x100 */
    __IO uint32_t CTLCLRUSART;                       /**< USART0 control clear register. Writing a 1 to any implemented bit position causes the corresponding bit in the related CTLSET register to be cleared., array offset: 0x1010, array step: 0x100 */
    __IO uint32_t RXDATUSART;                        /**< USART0 received data, array offset: 0x1014, array step: 0x100 */
    __IO uint32_t RXDATSTATUSART;                    /**< USART0 received data with status, array offset: 0x1018, array step: 0x100 */
    __IO uint32_t TXDATUSART;                        /**< USART0 transmit data, array offset: 0x101C, array step: 0x100 */
         uint8_t RESERVED_0[224];
  } USART[VFIFO_USART_COUNT];
       uint8_t RESERVED_5[3072];
  struct {                                         /* offset: 0x2000, array step: 0x100 */
    __IO uint32_t CFGSPI;                            /**< SPI0 configuration, array offset: 0x2000, array step: 0x100 */
    __IO uint32_t STATSPI;                           /**< SPI0 status, array offset: 0x2004, array step: 0x100 */
    __IO uint32_t INTSTATSPI;                        /**< SPI0 interrupt status, array offset: 0x2008, array step: 0x100 */
    __IO uint32_t CTLSETSPI;                         /**< SPI0 control read and set register. A complete value may be read from this register. Writing a 1 to any implemented bit position causes that bit to be set., array offset: 0x200C, array step: 0x100 */
    __IO uint32_t CTLCLRSPI;                         /**< SPI0 control clear register. Writing a 1 to any implemented bit position causes the corresponding bit in the related CTLSET register to be cleared., array offset: 0x2010, array step: 0x100 */
    __IO uint32_t RXDATSPI;                          /**< SPI0 received data. These registers are half word addressable., array offset: 0x2014, array step: 0x100 */
    __IO uint32_t TXDATSPI;                          /**< SPI0 transmit data. These registers are half word addressable., array offset: 0x2018, array step: 0x100 */
         uint8_t RESERVED_0[228];
  } SPI[VFIFO_SPI_COUNT];
} VFIFO_Type;

/* ----------------------------------------------------------------------------
   -- VFIFO Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VFIFO_Register_Masks VFIFO Register Masks
 * @{
 */

/*! @name FIFOCTLUSART - USART FIFO global control register. These registers are byte, halfword, and word addressable.The upper 16 bits of these registers provide information about the System FIFO configuration, and are specific to each device type. */
/*! @{ */

#define VFIFO_FIFOCTLUSART_RXPAUSE_MASK          (0x1U)
#define VFIFO_FIFOCTLUSART_RXPAUSE_SHIFT         (0U)
/*! RXPAUSE - Pause all USARTs receive FIFO operations. This can be used to prepare the System FIFO
 *    to reconfigure FIFO allocations among the USART receivers.
 */
#define VFIFO_FIFOCTLUSART_RXPAUSE(x)            (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLUSART_RXPAUSE_SHIFT)) & VFIFO_FIFOCTLUSART_RXPAUSE_MASK)

#define VFIFO_FIFOCTLUSART_RXPAUSED_MASK         (0x2U)
#define VFIFO_FIFOCTLUSART_RXPAUSED_SHIFT        (1U)
/*! RXPAUSED - All USART receive FIFOs are paused. */
#define VFIFO_FIFOCTLUSART_RXPAUSED(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLUSART_RXPAUSED_SHIFT)) & VFIFO_FIFOCTLUSART_RXPAUSED_MASK)

#define VFIFO_FIFOCTLUSART_RXEMPTY_MASK          (0x4U)
#define VFIFO_FIFOCTLUSART_RXEMPTY_SHIFT         (2U)
/*! RXEMPTY - All USART receive FIFOs are empty. */
#define VFIFO_FIFOCTLUSART_RXEMPTY(x)            (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLUSART_RXEMPTY_SHIFT)) & VFIFO_FIFOCTLUSART_RXEMPTY_MASK)

#define VFIFO_FIFOCTLUSART_TXPAUSE_MASK          (0x100U)
#define VFIFO_FIFOCTLUSART_TXPAUSE_SHIFT         (8U)
/*! TXPAUSE - Pause all USARTs transmit FIFO operations. This can be used to prepare the System FIFO
 *    to reconfigure FIFO allocations among the USART transmitters.
 */
#define VFIFO_FIFOCTLUSART_TXPAUSE(x)            (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLUSART_TXPAUSE_SHIFT)) & VFIFO_FIFOCTLUSART_TXPAUSE_MASK)

#define VFIFO_FIFOCTLUSART_TXPAUSED_MASK         (0x200U)
#define VFIFO_FIFOCTLUSART_TXPAUSED_SHIFT        (9U)
/*! TXPAUSED - All USART transmit FIFOs are paused. */
#define VFIFO_FIFOCTLUSART_TXPAUSED(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLUSART_TXPAUSED_SHIFT)) & VFIFO_FIFOCTLUSART_TXPAUSED_MASK)

#define VFIFO_FIFOCTLUSART_TXEMPTY_MASK          (0x400U)
#define VFIFO_FIFOCTLUSART_TXEMPTY_SHIFT         (10U)
/*! TXEMPTY - All USART transmit FIFOs are empty. */
#define VFIFO_FIFOCTLUSART_TXEMPTY(x)            (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLUSART_TXEMPTY_SHIFT)) & VFIFO_FIFOCTLUSART_TXEMPTY_MASK)

#define VFIFO_FIFOCTLUSART_RXFIFOTOTAL_MASK      (0xFF0000U)
#define VFIFO_FIFOCTLUSART_RXFIFOTOTAL_SHIFT     (16U)
/*! RXFIFOTOTAL - Reports the receive FIFO space available for USARTs on this FIFO. The reset value is device specific. */
#define VFIFO_FIFOCTLUSART_RXFIFOTOTAL(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLUSART_RXFIFOTOTAL_SHIFT)) & VFIFO_FIFOCTLUSART_RXFIFOTOTAL_MASK)

#define VFIFO_FIFOCTLUSART_TXFIFOTOTAL_MASK      (0xFF000000U)
#define VFIFO_FIFOCTLUSART_TXFIFOTOTAL_SHIFT     (24U)
/*! TXFIFOTOTAL - Reports the transmit FIFO space available for USARTs on this FIFO. The reset value is device specific. */
#define VFIFO_FIFOCTLUSART_TXFIFOTOTAL(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLUSART_TXFIFOTOTAL_SHIFT)) & VFIFO_FIFOCTLUSART_TXFIFOTOTAL_MASK)
/*! @} */

/*! @name FIFOUPDATEUSART - USART FIFO global update register */
/*! @{ */

#define VFIFO_FIFOUPDATEUSART_USART0RXUPDATESIZE_MASK (0x1U)
#define VFIFO_FIFOUPDATEUSART_USART0RXUPDATESIZE_SHIFT (0U)
/*! USART0RXUPDATESIZE - Writing 1 updates USART0 Rx FIFO size to match the USART0 RXSIZE. Must be
 *    done for all USARTs when any USART RXSIZE is changed.
 */
#define VFIFO_FIFOUPDATEUSART_USART0RXUPDATESIZE(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATEUSART_USART0RXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATEUSART_USART0RXUPDATESIZE_MASK)

#define VFIFO_FIFOUPDATEUSART_USART1RXUPDATESIZE_MASK (0x2U)
#define VFIFO_FIFOUPDATEUSART_USART1RXUPDATESIZE_SHIFT (1U)
/*! USART1RXUPDATESIZE - Writing 1 updates USART1 Rx FIFO size to match the USART1 RXSIZE. Must be
 *    done for all USARTs when any USART RXSIZE is changed.
 */
#define VFIFO_FIFOUPDATEUSART_USART1RXUPDATESIZE(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATEUSART_USART1RXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATEUSART_USART1RXUPDATESIZE_MASK)

