zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC54000/periph4/PERI_VFIFO.h
#define VFIFO_FIFOUPDATEUSART_USART2RXUPDATESIZE_MASK (0x4U)
#define VFIFO_FIFOUPDATEUSART_USART2RXUPDATESIZE_SHIFT (2U)
/*! USART2RXUPDATESIZE - Writing 1 updates USART2 Rx FIFO size to match the USART2 RXSIZE. Must be
 *    done for all USARTs when any USART RXSIZE is changed.
 */
#define VFIFO_FIFOUPDATEUSART_USART2RXUPDATESIZE(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATEUSART_USART2RXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATEUSART_USART2RXUPDATESIZE_MASK)

#define VFIFO_FIFOUPDATEUSART_USART3RXUPDATESIZE_MASK (0x8U)
#define VFIFO_FIFOUPDATEUSART_USART3RXUPDATESIZE_SHIFT (3U)
/*! USART3RXUPDATESIZE - Writing 1 updates USART3 Rx FIFO size to match the USART3 RXSIZE. Must be
 *    done for all USARTs when any USART RXSIZE is changed.
 */
#define VFIFO_FIFOUPDATEUSART_USART3RXUPDATESIZE(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATEUSART_USART3RXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATEUSART_USART3RXUPDATESIZE_MASK)

#define VFIFO_FIFOUPDATEUSART_USART0TXUPDATESIZE_MASK (0x10000U)
#define VFIFO_FIFOUPDATEUSART_USART0TXUPDATESIZE_SHIFT (16U)
/*! USART0TXUPDATESIZE - Writing 1 updates USART0 Tx FIFO size to match the USART0 TXSIZE. Must be
 *    done for all USARTs when any USART TXSIZE is changed.
 */
#define VFIFO_FIFOUPDATEUSART_USART0TXUPDATESIZE(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATEUSART_USART0TXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATEUSART_USART0TXUPDATESIZE_MASK)

#define VFIFO_FIFOUPDATEUSART_USART1TXUPDATESIZE_MASK (0x20000U)
#define VFIFO_FIFOUPDATEUSART_USART1TXUPDATESIZE_SHIFT (17U)
/*! USART1TXUPDATESIZE - Writing 1 updates USART1 Tx FIFO size to match the USART1 TXSIZE. Must be
 *    done for all USARTs when any USART TXSIZE is changed.
 */
#define VFIFO_FIFOUPDATEUSART_USART1TXUPDATESIZE(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATEUSART_USART1TXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATEUSART_USART1TXUPDATESIZE_MASK)

#define VFIFO_FIFOUPDATEUSART_USART2TXUPDATESIZE_MASK (0x40000U)
#define VFIFO_FIFOUPDATEUSART_USART2TXUPDATESIZE_SHIFT (18U)
/*! USART2TXUPDATESIZE - Writing 1 updates USART2 Tx FIFO size to match the USART2 TXSIZE. Must be
 *    done for all USARTs when any USART TXSIZE is changed.
 */
#define VFIFO_FIFOUPDATEUSART_USART2TXUPDATESIZE(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATEUSART_USART2TXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATEUSART_USART2TXUPDATESIZE_MASK)

#define VFIFO_FIFOUPDATEUSART_USART3TXUPDATESIZE_MASK (0x80000U)
#define VFIFO_FIFOUPDATEUSART_USART3TXUPDATESIZE_SHIFT (19U)
/*! USART3TXUPDATESIZE - Writing 1 updates USART3 Tx FIFO size to match the USART3 TXSIZE. Must be
 *    done for all USARTs when any USART TXSIZE is changed.
 */
#define VFIFO_FIFOUPDATEUSART_USART3TXUPDATESIZE(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATEUSART_USART3TXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATEUSART_USART3TXUPDATESIZE_MASK)
/*! @} */

/*! @name FIFOCFGUSART - FIFO configuration register for USART0 */
/*! @{ */

#define VFIFO_FIFOCFGUSART_RXSIZE_MASK           (0xFFU)
#define VFIFO_FIFOCFGUSART_RXSIZE_SHIFT          (0U)
/*! RXSIZE - Configures the USART receive FIFO size. A zero values provides no System FIFO service for the related USART receiver. */
#define VFIFO_FIFOCFGUSART_RXSIZE(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCFGUSART_RXSIZE_SHIFT)) & VFIFO_FIFOCFGUSART_RXSIZE_MASK)

#define VFIFO_FIFOCFGUSART_TXSIZE_MASK           (0xFF00U)
#define VFIFO_FIFOCFGUSART_TXSIZE_SHIFT          (8U)
/*! TXSIZE - Configures the USART transmit FIFO size. A zero values provides no System FIFO service
 *    for the related USART transmitter.
 */
#define VFIFO_FIFOCFGUSART_TXSIZE(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCFGUSART_TXSIZE_SHIFT)) & VFIFO_FIFOCFGUSART_TXSIZE_MASK)
/*! @} */

/*! @name FIFOCTLSPI - SPI FIFO global control register. These registers are byte, halfword, and word addressable. The upper 16 bits of these registers provide information about the System FIFO configuration, and are specific to each device type. */
/*! @{ */

#define VFIFO_FIFOCTLSPI_RXPAUSE_MASK            (0x1U)
#define VFIFO_FIFOCTLSPI_RXPAUSE_SHIFT           (0U)
/*! RXPAUSE - Pause all SPIs receive FIFO operations. This can be used to prepare the System FIFO to
 *    reconfigure FIFO allocations among the SPI receivers.
 */
#define VFIFO_FIFOCTLSPI_RXPAUSE(x)              (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLSPI_RXPAUSE_SHIFT)) & VFIFO_FIFOCTLSPI_RXPAUSE_MASK)

#define VFIFO_FIFOCTLSPI_RXPAUSED_MASK           (0x2U)
#define VFIFO_FIFOCTLSPI_RXPAUSED_SHIFT          (1U)
/*! RXPAUSED - All SPI receive FIFOs are paused. */
#define VFIFO_FIFOCTLSPI_RXPAUSED(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLSPI_RXPAUSED_SHIFT)) & VFIFO_FIFOCTLSPI_RXPAUSED_MASK)

#define VFIFO_FIFOCTLSPI_RXEMPTY_MASK            (0x4U)
#define VFIFO_FIFOCTLSPI_RXEMPTY_SHIFT           (2U)
/*! RXEMPTY - All SPI receive FIFOs are empty. */
#define VFIFO_FIFOCTLSPI_RXEMPTY(x)              (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLSPI_RXEMPTY_SHIFT)) & VFIFO_FIFOCTLSPI_RXEMPTY_MASK)

#define VFIFO_FIFOCTLSPI_TXPAUSE_MASK            (0x100U)
#define VFIFO_FIFOCTLSPI_TXPAUSE_SHIFT           (8U)
/*! TXPAUSE - Pause all SPIs transmit FIFO operations. This can be used to prepare the System FIFO
 *    to reconfigure FIFO allocations among the SPI transmitters.
 */
#define VFIFO_FIFOCTLSPI_TXPAUSE(x)              (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLSPI_TXPAUSE_SHIFT)) & VFIFO_FIFOCTLSPI_TXPAUSE_MASK)

#define VFIFO_FIFOCTLSPI_TXPAUSED_MASK           (0x200U)
#define VFIFO_FIFOCTLSPI_TXPAUSED_SHIFT          (9U)
/*! TXPAUSED - All SPI transmit FIFOs are paused. */
#define VFIFO_FIFOCTLSPI_TXPAUSED(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLSPI_TXPAUSED_SHIFT)) & VFIFO_FIFOCTLSPI_TXPAUSED_MASK)

#define VFIFO_FIFOCTLSPI_TXEMPTY_MASK            (0x400U)
#define VFIFO_FIFOCTLSPI_TXEMPTY_SHIFT           (10U)
/*! TXEMPTY - All SPI transmit FIFOs are empty. */
#define VFIFO_FIFOCTLSPI_TXEMPTY(x)              (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLSPI_TXEMPTY_SHIFT)) & VFIFO_FIFOCTLSPI_TXEMPTY_MASK)

#define VFIFO_FIFOCTLSPI_RXFIFOTOTAL_MASK        (0xFF0000U)
#define VFIFO_FIFOCTLSPI_RXFIFOTOTAL_SHIFT       (16U)
/*! RXFIFOTOTAL - Reports the receive FIFO space available for SPIs on the System FIFO. The reset value is device specific. */
#define VFIFO_FIFOCTLSPI_RXFIFOTOTAL(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLSPI_RXFIFOTOTAL_SHIFT)) & VFIFO_FIFOCTLSPI_RXFIFOTOTAL_MASK)

#define VFIFO_FIFOCTLSPI_TXFIFOTOTAL_MASK        (0xFF000000U)
#define VFIFO_FIFOCTLSPI_TXFIFOTOTAL_SHIFT       (24U)
/*! TXFIFOTOTAL - Reports the transmit FIFO space available for SPIs on the System FIFO. The reset value is device specific. */
#define VFIFO_FIFOCTLSPI_TXFIFOTOTAL(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCTLSPI_TXFIFOTOTAL_SHIFT)) & VFIFO_FIFOCTLSPI_TXFIFOTOTAL_MASK)
/*! @} */

