zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC54000/periph4/PERI_VFIFO.h
/*! @name FIFOUPDATESPI - SPI FIFO global update register */
/*! @{ */

#define VFIFO_FIFOUPDATESPI_SPI0RXUPDATESIZE_MASK (0x1U)
#define VFIFO_FIFOUPDATESPI_SPI0RXUPDATESIZE_SHIFT (0U)
/*! SPI0RXUPDATESIZE - Writing 1 updates SPI0 Rx FIFO size to match the SPI0 RXSIZE. Must be done for all SPIs when any SPI RXSIZE is changed. */
#define VFIFO_FIFOUPDATESPI_SPI0RXUPDATESIZE(x)  (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATESPI_SPI0RXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATESPI_SPI0RXUPDATESIZE_MASK)

#define VFIFO_FIFOUPDATESPI_SPI1RXUPDATESIZE_MASK (0x2U)
#define VFIFO_FIFOUPDATESPI_SPI1RXUPDATESIZE_SHIFT (1U)
/*! SPI1RXUPDATESIZE - Writing 1 updates SPI1 Rx FIFO size to match the SPI1 RXSIZE. Must be done for all SPIs when any SPI RXSIZE is changed. */
#define VFIFO_FIFOUPDATESPI_SPI1RXUPDATESIZE(x)  (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATESPI_SPI1RXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATESPI_SPI1RXUPDATESIZE_MASK)

#define VFIFO_FIFOUPDATESPI_SPI0TXUPDATESIZE_MASK (0x10000U)
#define VFIFO_FIFOUPDATESPI_SPI0TXUPDATESIZE_SHIFT (16U)
/*! SPI0TXUPDATESIZE - Writing 1 updates SPI0 Tx FIFO size to match the SPI0 TXSIZE. Must be done for all SPIs when any SPI TXSIZE is changed. */
#define VFIFO_FIFOUPDATESPI_SPI0TXUPDATESIZE(x)  (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATESPI_SPI0TXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATESPI_SPI0TXUPDATESIZE_MASK)

#define VFIFO_FIFOUPDATESPI_SPI1TXUPDATESIZE_MASK (0x20000U)
#define VFIFO_FIFOUPDATESPI_SPI1TXUPDATESIZE_SHIFT (17U)
/*! SPI1TXUPDATESIZE - Writing 1 updates SPI1 Tx FIFO size to match the SPI1 TXSIZE. Must be done for all SPIs when any SPI TXSIZE is changed. */
#define VFIFO_FIFOUPDATESPI_SPI1TXUPDATESIZE(x)  (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATESPI_SPI1TXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATESPI_SPI1TXUPDATESIZE_MASK)
/*! @} */

/*! @name FIFOCFGSPI - FIFO configuration register for SPI0 */
/*! @{ */

#define VFIFO_FIFOCFGSPI_RXSIZE_MASK             (0xFFU)
#define VFIFO_FIFOCFGSPI_RXSIZE_SHIFT            (0U)
/*! RXSIZE - Configures the SPI receive FIFO size. A zero values provides no System FIFO service for the related SPI receiver. */
#define VFIFO_FIFOCFGSPI_RXSIZE(x)               (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCFGSPI_RXSIZE_SHIFT)) & VFIFO_FIFOCFGSPI_RXSIZE_MASK)

#define VFIFO_FIFOCFGSPI_TXSIZE_MASK             (0xFF00U)
#define VFIFO_FIFOCFGSPI_TXSIZE_SHIFT            (8U)
/*! TXSIZE - Configures the SPI transmit FIFO size. A zero values provides no System FIFO service for the related SPI transmitter. */
#define VFIFO_FIFOCFGSPI_TXSIZE(x)               (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCFGSPI_TXSIZE_SHIFT)) & VFIFO_FIFOCFGSPI_TXSIZE_MASK)
/*! @} */

/*! @name USART_CFGUSART - USART0 configuration */
/*! @{ */

#define VFIFO_USART_CFGUSART_TIMEOUTCONTONWRITE_MASK (0x10U)
#define VFIFO_USART_CFGUSART_TIMEOUTCONTONWRITE_SHIFT (4U)
/*! TIMEOUTCONTONWRITE - Timeout Continue On Write. When 0, the timeout for the related peripheral
 *    is reset every time data is transferred from the peripheral into the receive FIFO. When 1, the
 *    timeout for the related peripheral is not reset every time data is transferred into the
 *    receive FIFO. This allows the timeout to be applied to accumulated data, perhaps related to the FIFO
 *    threshold.
 */
#define VFIFO_USART_CFGUSART_TIMEOUTCONTONWRITE(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_TIMEOUTCONTONWRITE_SHIFT)) & VFIFO_USART_CFGUSART_TIMEOUTCONTONWRITE_MASK)

#define VFIFO_USART_CFGUSART_TIMEOUTCONTONEMPTY_MASK (0x20U)
#define VFIFO_USART_CFGUSART_TIMEOUTCONTONEMPTY_SHIFT (5U)
/*! TIMEOUTCONTONEMPTY - Timeout Continue On Empty. When 0, the timeout for the related peripheral
 *    is reset when the receive FIFO becomes empty. When 1, the timeout for the related peripheral is
 *    not reset when the receive FIFO becomes empty. This allows the timeout to be used to flag
 *    idle peripherals, and could potentially be used to indicate the end of a transmission of
 *    indeterminate length.
 */
#define VFIFO_USART_CFGUSART_TIMEOUTCONTONEMPTY(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_TIMEOUTCONTONEMPTY_SHIFT)) & VFIFO_USART_CFGUSART_TIMEOUTCONTONEMPTY_MASK)

#define VFIFO_USART_CFGUSART_TIMEOUTBASE_MASK    (0xF00U)
#define VFIFO_USART_CFGUSART_TIMEOUTBASE_SHIFT   (8U)
/*! TIMEOUTBASE - Specifies the least significant timer bit to compare to TimeoutValue. See Section
 *    24.5.7.1 below. Value can be 0 through 15.
 */
#define VFIFO_USART_CFGUSART_TIMEOUTBASE(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_TIMEOUTBASE_SHIFT)) & VFIFO_USART_CFGUSART_TIMEOUTBASE_MASK)

#define VFIFO_USART_CFGUSART_TIMEOUTVALUE_MASK   (0xF000U)
#define VFIFO_USART_CFGUSART_TIMEOUTVALUE_SHIFT  (12U)
/*! TIMEOUTVALUE - Specifies the maximum time value for timeout at the timer position identified by
 *    TimeoutBase. Minimum time TimeoutValue - 1. is See Section 24.5.7.1 below. TimeoutValue should
 *    not be 0 or 1 when timeout is enabled.
 */
#define VFIFO_USART_CFGUSART_TIMEOUTVALUE(x)     (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_TIMEOUTVALUE_SHIFT)) & VFIFO_USART_CFGUSART_TIMEOUTVALUE_MASK)

#define VFIFO_USART_CFGUSART_RXTHRESHOLD_MASK    (0xFF0000U)
#define VFIFO_USART_CFGUSART_RXTHRESHOLD_SHIFT   (16U)
/*! RXTHRESHOLD - Receive FIFO Threshold. The System FIFO indicates that the threshold has been
 *    reached when the number of entries in the receive FIFO is greater than this value. For example,
 *    when RxThreshold = 0, the threshold is exceeded when there is at least one entry in the receive
 *    FIFO. An interrupt can be generated when the RxThreshold has been reached (see Section
 *    24.5.10), but has no effect on DMA requests, which are generated whenever the receiver FIFO is not
 *    empty.
 */
#define VFIFO_USART_CFGUSART_RXTHRESHOLD(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_RXTHRESHOLD_SHIFT)) & VFIFO_USART_CFGUSART_RXTHRESHOLD_MASK)

#define VFIFO_USART_CFGUSART_TXTHRESHOLD_MASK    (0xFF000000U)
#define VFIFO_USART_CFGUSART_TXTHRESHOLD_SHIFT   (24U)
/*! TXTHRESHOLD - Transmit FIFO Threshold. The System FIFO indicates that the threshold has been
 *    reached when the number of free entries in the transmit FIFO is less than or equal to this value.
 *    For example, when TxThreshold = 0, the threshold is exceeded when there is at least one free
 *    entry in the transmit FIFO. An interrupt can be generated when the TxThreshold has been
 *    reached (see Section 24.5.10), but has no effect on DMA requests, which are generated whenever the
 *    transmit FIFO has any free entries.
 */
#define VFIFO_USART_CFGUSART_TXTHRESHOLD(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_TXTHRESHOLD_SHIFT)) & VFIFO_USART_CFGUSART_TXTHRESHOLD_MASK)
/*! @} */

/* The count of VFIFO_USART_CFGUSART */
#define VFIFO_USART_CFGUSART_COUNT               (4U)

