zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC54000/periph4/PERI_VFIFO.h
/*! @name USART_STATUSART - USART0 status */
/*! @{ */

#define VFIFO_USART_STATUSART_RXTH_MASK          (0x1U)
#define VFIFO_USART_STATUSART_RXTH_SHIFT         (0U)
/*! RXTH - Receive FIFO Threshold. When 1, the receive FIFO threshold has been reached. This is a read-only bit. */
#define VFIFO_USART_STATUSART_RXTH(x)            (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_RXTH_SHIFT)) & VFIFO_USART_STATUSART_RXTH_MASK)

#define VFIFO_USART_STATUSART_TXTH_MASK          (0x2U)
#define VFIFO_USART_STATUSART_TXTH_SHIFT         (1U)
/*! TXTH - Transmit FIFO Threshold. When 1, the transmit FIFO threshold has been reached. This is a read-only bit. */
#define VFIFO_USART_STATUSART_TXTH(x)            (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_TXTH_SHIFT)) & VFIFO_USART_STATUSART_TXTH_MASK)

#define VFIFO_USART_STATUSART_RXTIMEOUT_MASK     (0x10U)
#define VFIFO_USART_STATUSART_RXTIMEOUT_SHIFT    (4U)
/*! RXTIMEOUT - Receive FIFO Timeout. When 1, the receive FIFO has timed out, based on the timeout
 *    configuration in the CFGUSART register. The timeout condition can be cleared by writing a 1 to
 *    this bit, by enabling or disabling the timeout interrupt, or by writing a 1 to the timeout
 *    interrupt enable.
 */
#define VFIFO_USART_STATUSART_RXTIMEOUT(x)       (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_RXTIMEOUT_SHIFT)) & VFIFO_USART_STATUSART_RXTIMEOUT_MASK)

#define VFIFO_USART_STATUSART_BUSERR_MASK        (0x80U)
#define VFIFO_USART_STATUSART_BUSERR_SHIFT       (7U)
/*! BUSERR - Bus Error. When 1, a bus error has occurred while processing data for USARTn. The bus
 *    error flag can be cleared by writing a 1 to this bit.
 */
#define VFIFO_USART_STATUSART_BUSERR(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_BUSERR_SHIFT)) & VFIFO_USART_STATUSART_BUSERR_MASK)

#define VFIFO_USART_STATUSART_RXEMPTY_MASK       (0x100U)
#define VFIFO_USART_STATUSART_RXEMPTY_SHIFT      (8U)
/*! RXEMPTY - Receive FIFO Empty. When 1, the receive FIFO is currently empty. This is a read-only bit. */
#define VFIFO_USART_STATUSART_RXEMPTY(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_RXEMPTY_SHIFT)) & VFIFO_USART_STATUSART_RXEMPTY_MASK)

#define VFIFO_USART_STATUSART_TXEMPTY_MASK       (0x200U)
#define VFIFO_USART_STATUSART_TXEMPTY_SHIFT      (9U)
/*! TXEMPTY - Transmit FIFO Empty. When 1, the transmit FIFO is currently empty. This is a read-only bit. */
#define VFIFO_USART_STATUSART_TXEMPTY(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_TXEMPTY_SHIFT)) & VFIFO_USART_STATUSART_TXEMPTY_MASK)

#define VFIFO_USART_STATUSART_RXCOUNT_MASK       (0xFF0000U)
#define VFIFO_USART_STATUSART_RXCOUNT_SHIFT      (16U)
/*! RXCOUNT - Receive FIFO Count. Indicates how many entries may be read from the receive FIFO. 0 =
 *    FIFO empty. This is a read-only field.
 */
#define VFIFO_USART_STATUSART_RXCOUNT(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_RXCOUNT_SHIFT)) & VFIFO_USART_STATUSART_RXCOUNT_MASK)

#define VFIFO_USART_STATUSART_TXCOUNT_MASK       (0xFF000000U)
#define VFIFO_USART_STATUSART_TXCOUNT_SHIFT      (24U)
/*! TXCOUNT - Transmit FIFO Count. Indicates how many entries may be written to the transmit FIFO. 0
 *    = FIFO full. This is a read-only field that is valid only when the TxFIFO is fully configured
 *    and enabled.
 */
#define VFIFO_USART_STATUSART_TXCOUNT(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_TXCOUNT_SHIFT)) & VFIFO_USART_STATUSART_TXCOUNT_MASK)
/*! @} */

/* The count of VFIFO_USART_STATUSART */
#define VFIFO_USART_STATUSART_COUNT              (4U)

/*! @name USART_INTSTATUSART - USART0 interrupt status */
/*! @{ */

#define VFIFO_USART_INTSTATUSART_RXTH_MASK       (0x1U)
#define VFIFO_USART_INTSTATUSART_RXTH_SHIFT      (0U)
/*! RXTH - Receive FIFO Threshold. When 1, the receive FIFO threshold has been reached, and the related interrupt is enabled. */
#define VFIFO_USART_INTSTATUSART_RXTH(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_RXTH_SHIFT)) & VFIFO_USART_INTSTATUSART_RXTH_MASK)

#define VFIFO_USART_INTSTATUSART_TXTH_MASK       (0x2U)
#define VFIFO_USART_INTSTATUSART_TXTH_SHIFT      (1U)
/*! TXTH - Transmit FIFO Threshold. When 1, the transmit FIFO threshold has been reached, and the related interrupt is enabled. */
#define VFIFO_USART_INTSTATUSART_TXTH(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_TXTH_SHIFT)) & VFIFO_USART_INTSTATUSART_TXTH_MASK)

#define VFIFO_USART_INTSTATUSART_RXTIMEOUT_MASK  (0x10U)
#define VFIFO_USART_INTSTATUSART_RXTIMEOUT_SHIFT (4U)
/*! RXTIMEOUT - Receive Timeout. When 1, the receive FIFO has timed out, based on the timeout
 *    configuration in the CFGUSART register, and the related interrupt is enabled.
 */
#define VFIFO_USART_INTSTATUSART_RXTIMEOUT(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_RXTIMEOUT_SHIFT)) & VFIFO_USART_INTSTATUSART_RXTIMEOUT_MASK)

#define VFIFO_USART_INTSTATUSART_BUSERR_MASK     (0x80U)
#define VFIFO_USART_INTSTATUSART_BUSERR_SHIFT    (7U)
/*! BUSERR - Bus Error. This is simply a copy of the same bit in the STATUSART register. The bus error interrupt is always enabled. */
#define VFIFO_USART_INTSTATUSART_BUSERR(x)       (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_BUSERR_SHIFT)) & VFIFO_USART_INTSTATUSART_BUSERR_MASK)

#define VFIFO_USART_INTSTATUSART_RXEMPTY_MASK    (0x100U)
#define VFIFO_USART_INTSTATUSART_RXEMPTY_SHIFT   (8U)
/*! RXEMPTY - Receive FIFO Empty. This is simply a copy of the same bit in the STATUSART register. */
#define VFIFO_USART_INTSTATUSART_RXEMPTY(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_RXEMPTY_SHIFT)) & VFIFO_USART_INTSTATUSART_RXEMPTY_MASK)

#define VFIFO_USART_INTSTATUSART_TXEMPTY_MASK    (0x200U)
#define VFIFO_USART_INTSTATUSART_TXEMPTY_SHIFT   (9U)
/*! TXEMPTY - Transmit FIFO Empty. This is simply a copy of the same bit in the STATUSART register. */
#define VFIFO_USART_INTSTATUSART_TXEMPTY(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_TXEMPTY_SHIFT)) & VFIFO_USART_INTSTATUSART_TXEMPTY_MASK)

#define VFIFO_USART_INTSTATUSART_RXCOUNT_MASK    (0xFF0000U)
#define VFIFO_USART_INTSTATUSART_RXCOUNT_SHIFT   (16U)
/*! RXCOUNT - Receive FIFO Count. This is simply a copy of the same field in the STATUSART register,
 *    included here so an ISR can read all needed status information in one read.
 */
#define VFIFO_USART_INTSTATUSART_RXCOUNT(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_RXCOUNT_SHIFT)) & VFIFO_USART_INTSTATUSART_RXCOUNT_MASK)

#define VFIFO_USART_INTSTATUSART_TXCOUNT_MASK    (0xFF000000U)
#define VFIFO_USART_INTSTATUSART_TXCOUNT_SHIFT   (24U)
/*! TXCOUNT - Transmit FIFO Available. This is simply a copy of the same field in the STATUSART
 *    register, included here so an ISR can read all needed status information in one read.
 */
#define VFIFO_USART_INTSTATUSART_TXCOUNT(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_TXCOUNT_SHIFT)) & VFIFO_USART_INTSTATUSART_TXCOUNT_MASK)
/*! @} */

