zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC54000/periph4/PERI_VFIFO.h
/* The count of VFIFO_USART_INTSTATUSART */
#define VFIFO_USART_INTSTATUSART_COUNT           (4U)

/*! @name USART_CTLSETUSART - USART0 control read and set register. A complete value may be read from this register. Writing a 1 to any implemented bit position causes that bit to be set. */
/*! @{ */

#define VFIFO_USART_CTLSETUSART_RXTHINTEN_MASK   (0x1U)
#define VFIFO_USART_CTLSETUSART_RXTHINTEN_SHIFT  (0U)
/*! RXTHINTEN - Receive FIFO Threshold Interrupt Enable. */
#define VFIFO_USART_CTLSETUSART_RXTHINTEN(x)     (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLSETUSART_RXTHINTEN_SHIFT)) & VFIFO_USART_CTLSETUSART_RXTHINTEN_MASK)

#define VFIFO_USART_CTLSETUSART_TXTHINTEN_MASK   (0x2U)
#define VFIFO_USART_CTLSETUSART_TXTHINTEN_SHIFT  (1U)
/*! TXTHINTEN - Transmit FIFO Threshold Interrupt Enable. */
#define VFIFO_USART_CTLSETUSART_TXTHINTEN(x)     (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLSETUSART_TXTHINTEN_SHIFT)) & VFIFO_USART_CTLSETUSART_TXTHINTEN_MASK)

#define VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN_MASK (0x10U)
#define VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN_SHIFT (4U)
/*! RXTIMEOUTINTEN - Receive FIFO Timeout Interrupt Enable. When enabled, this also enables the
 *    timeout for this USART. Writing a 1 to this bit resets the USART timeout logic.
 */
#define VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN_SHIFT)) & VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN_MASK)

#define VFIFO_USART_CTLSETUSART_RXFLUSH_MASK     (0x100U)
#define VFIFO_USART_CTLSETUSART_RXFLUSH_SHIFT    (8U)
/*! RXFLUSH - Receive FIFO flush. Writing a 1 to this bit forces the receive FIFO to be empty. */
#define VFIFO_USART_CTLSETUSART_RXFLUSH(x)       (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLSETUSART_RXFLUSH_SHIFT)) & VFIFO_USART_CTLSETUSART_RXFLUSH_MASK)

#define VFIFO_USART_CTLSETUSART_TXFLUSH_MASK     (0x200U)
#define VFIFO_USART_CTLSETUSART_TXFLUSH_SHIFT    (9U)
/*! TXFLUSH - Transmit FIFO flush. Writing a 1 to this bit forces the transmit FIFO to be empty. */
#define VFIFO_USART_CTLSETUSART_TXFLUSH(x)       (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLSETUSART_TXFLUSH_SHIFT)) & VFIFO_USART_CTLSETUSART_TXFLUSH_MASK)
/*! @} */

/* The count of VFIFO_USART_CTLSETUSART */
#define VFIFO_USART_CTLSETUSART_COUNT            (4U)

/*! @name USART_CTLCLRUSART - USART0 control clear register. Writing a 1 to any implemented bit position causes the corresponding bit in the related CTLSET register to be cleared. */
/*! @{ */

#define VFIFO_USART_CTLCLRUSART_RXTHINTCLR_MASK  (0x1U)
#define VFIFO_USART_CTLCLRUSART_RXTHINTCLR_SHIFT (0U)
/*! RXTHINTCLR - Receive FIFO Threshold Interrupt clear. */
#define VFIFO_USART_CTLCLRUSART_RXTHINTCLR(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLCLRUSART_RXTHINTCLR_SHIFT)) & VFIFO_USART_CTLCLRUSART_RXTHINTCLR_MASK)

#define VFIFO_USART_CTLCLRUSART_TXTHINTCLR_MASK  (0x2U)
#define VFIFO_USART_CTLCLRUSART_TXTHINTCLR_SHIFT (1U)
/*! TXTHINTCLR - Transmit FIFO Threshold Interrupt clear. */
#define VFIFO_USART_CTLCLRUSART_TXTHINTCLR(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLCLRUSART_TXTHINTCLR_SHIFT)) & VFIFO_USART_CTLCLRUSART_TXTHINTCLR_MASK)

#define VFIFO_USART_CTLCLRUSART_RXTIMEOUTINTCLR_MASK (0x10U)
#define VFIFO_USART_CTLCLRUSART_RXTIMEOUTINTCLR_SHIFT (4U)
/*! RXTIMEOUTINTCLR - Receive FIFO Time-out Interrupt clear. */
#define VFIFO_USART_CTLCLRUSART_RXTIMEOUTINTCLR(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLCLRUSART_RXTIMEOUTINTCLR_SHIFT)) & VFIFO_USART_CTLCLRUSART_RXTIMEOUTINTCLR_MASK)

#define VFIFO_USART_CTLCLRUSART_RXFLUSHCLR_MASK  (0x100U)
#define VFIFO_USART_CTLCLRUSART_RXFLUSHCLR_SHIFT (8U)
/*! RXFLUSHCLR - Receive FIFO flush clear. */
#define VFIFO_USART_CTLCLRUSART_RXFLUSHCLR(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLCLRUSART_RXFLUSHCLR_SHIFT)) & VFIFO_USART_CTLCLRUSART_RXFLUSHCLR_MASK)

#define VFIFO_USART_CTLCLRUSART_TXFLUSHCLR_MASK  (0x200U)
#define VFIFO_USART_CTLCLRUSART_TXFLUSHCLR_SHIFT (9U)
/*! TXFLUSHCLR - Transmit FIFO flush clear. */
#define VFIFO_USART_CTLCLRUSART_TXFLUSHCLR(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLCLRUSART_TXFLUSHCLR_SHIFT)) & VFIFO_USART_CTLCLRUSART_TXFLUSHCLR_MASK)
/*! @} */

/* The count of VFIFO_USART_CTLCLRUSART */
#define VFIFO_USART_CTLCLRUSART_COUNT            (4U)

/*! @name USART_RXDATUSART - USART0 received data */
/*! @{ */

#define VFIFO_USART_RXDATUSART_RXDAT_MASK        (0x1FFU)
#define VFIFO_USART_RXDATUSART_RXDAT_SHIFT       (0U)
/*! RXDAT - The UART Receiver Data register contains the next received character. The number of bits
 *    that are relevant depends on the UART configuration settings.
 */
#define VFIFO_USART_RXDATUSART_RXDAT(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_RXDATUSART_RXDAT_SHIFT)) & VFIFO_USART_RXDATUSART_RXDAT_MASK)
/*! @} */

/* The count of VFIFO_USART_RXDATUSART */
#define VFIFO_USART_RXDATUSART_COUNT             (4U)

/*! @name USART_RXDATSTATUSART - USART0 received data with status */
/*! @{ */

#define VFIFO_USART_RXDATSTATUSART_RXDAT_MASK    (0x1FFU)
#define VFIFO_USART_RXDATSTATUSART_RXDAT_SHIFT   (0U)
/*! RXDAT - The UART Receiver Data register contains the next received character. The number of bits
 *    that are relevant depends on the UART configuration settings.
 */
#define VFIFO_USART_RXDATSTATUSART_RXDAT(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_RXDATSTATUSART_RXDAT_SHIFT)) & VFIFO_USART_RXDATSTATUSART_RXDAT_MASK)

#define VFIFO_USART_RXDATSTATUSART_FRAMERR_MASK  (0x2000U)
#define VFIFO_USART_RXDATSTATUSART_FRAMERR_SHIFT (13U)
/*! FRAMERR - Framing Error status flag. This bit is valid when there is a character to be read in
 *    the RXDAT register and reflects the status of that character. This bit will set when the
 *    character in RXDAT was received with a missing stop bit at the expected location. This could be an
 *    indication of a baud rate or configuration mismatch with the transmitting source.
 */
#define VFIFO_USART_RXDATSTATUSART_FRAMERR(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_RXDATSTATUSART_FRAMERR_SHIFT)) & VFIFO_USART_RXDATSTATUSART_FRAMERR_MASK)

#define VFIFO_USART_RXDATSTATUSART_PARITYERR_MASK (0x4000U)
#define VFIFO_USART_RXDATSTATUSART_PARITYERR_SHIFT (14U)
/*! PARITYERR - Parity Error status flag. This bit is valid when there is a character to be read in
 *    the RXDAT register and reflects the status of that character. This bit will be set when a
 *    parity error is detected in a received character.
 */
#define VFIFO_USART_RXDATSTATUSART_PARITYERR(x)  (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_RXDATSTATUSART_PARITYERR_SHIFT)) & VFIFO_USART_RXDATSTATUSART_PARITYERR_MASK)

