zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC54000/periph4/PERI_VFIFO.h
#define VFIFO_USART_RXDATSTATUSART_RXNOISE_MASK  (0x8000U)
#define VFIFO_USART_RXDATSTATUSART_RXNOISE_SHIFT (15U)
/*! RXNOISE - Received Noise flag. */
#define VFIFO_USART_RXDATSTATUSART_RXNOISE(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_RXDATSTATUSART_RXNOISE_SHIFT)) & VFIFO_USART_RXDATSTATUSART_RXNOISE_MASK)
/*! @} */

/* The count of VFIFO_USART_RXDATSTATUSART */
#define VFIFO_USART_RXDATSTATUSART_COUNT         (4U)

/*! @name USART_TXDATUSART - USART0 transmit data */
/*! @{ */

#define VFIFO_USART_TXDATUSART_TXDAT_MASK        (0x1FFU)
#define VFIFO_USART_TXDATUSART_TXDAT_SHIFT       (0U)
/*! TXDAT - Writing to the UART Transmit Data Register causes the data to be transmitted as soon as
 *    the transmit shift register is available and the condition for transmitting data is met: TXDIS
 *    bit = 0.
 */
#define VFIFO_USART_TXDATUSART_TXDAT(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_TXDATUSART_TXDAT_SHIFT)) & VFIFO_USART_TXDATUSART_TXDAT_MASK)
/*! @} */

/* The count of VFIFO_USART_TXDATUSART */
#define VFIFO_USART_TXDATUSART_COUNT             (4U)

/*! @name SPI_CFGSPI - SPI0 configuration */
/*! @{ */

#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONWRITE_MASK (0x10U)
#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONWRITE_SHIFT (4U)
/*! TIMEOUTCONTONWRITE - Timeout Continue On Write. When 0, the timeout for the related peripheral
 *    is reset every time data is transferred from the peripheral into the receive FIFO. When 1, the
 *    timeout for the related peripheral is not reset every time data is transferred into the
 *    receive FIFO. This allows the timeout to be applied to accumulated data, perhaps related to the FIFO
 *    threshold.
 */
#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONWRITE(x)   (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_TIMEOUTCONTONWRITE_SHIFT)) & VFIFO_SPI_CFGSPI_TIMEOUTCONTONWRITE_MASK)

#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONEMPTY_MASK (0x20U)
#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONEMPTY_SHIFT (5U)
/*! TIMEOUTCONTONEMPTY - Timeout Continue On Empty. When 0, the timeout for the related peripheral
 *    is reset when the receive FIFO becomes empty. When 1, the timeout for the related peripheral is
 *    not reset when the receive FIFO becomes empty. This allows the timeout to be used to flag
 *    idle peripherals, and could potentially be used to indicate the end of a transmission of
 *    indeterminate length.
 */
#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONEMPTY(x)   (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_TIMEOUTCONTONEMPTY_SHIFT)) & VFIFO_SPI_CFGSPI_TIMEOUTCONTONEMPTY_MASK)

#define VFIFO_SPI_CFGSPI_TIMEOUTBASE_MASK        (0xF00U)
#define VFIFO_SPI_CFGSPI_TIMEOUTBASE_SHIFT       (8U)
/*! TIMEOUTBASE - Specifies the least significant timer bit to compare to TimeoutValue. Value can be 0 through 15. */
#define VFIFO_SPI_CFGSPI_TIMEOUTBASE(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_TIMEOUTBASE_SHIFT)) & VFIFO_SPI_CFGSPI_TIMEOUTBASE_MASK)

#define VFIFO_SPI_CFGSPI_TIMEOUTVALUE_MASK       (0xF000U)
#define VFIFO_SPI_CFGSPI_TIMEOUTVALUE_SHIFT      (12U)
/*! TIMEOUTVALUE - Specifies the maximum time value for timeout at the timer position identified by
 *    TimeoutBase. Minimum time TimeoutValue - 1. TimeoutValue should not be 0 or 1 when timeout is
 *    enabled.
 */
#define VFIFO_SPI_CFGSPI_TIMEOUTVALUE(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_TIMEOUTVALUE_SHIFT)) & VFIFO_SPI_CFGSPI_TIMEOUTVALUE_MASK)

#define VFIFO_SPI_CFGSPI_RXTHRESHOLD_MASK        (0xFF0000U)
#define VFIFO_SPI_CFGSPI_RXTHRESHOLD_SHIFT       (16U)
/*! RXTHRESHOLD - Receive FIFO Threshold. The System FIFO indicates that the threshold has been
 *    reached when the number of entries in the receive FIFO is greater than this value. For example,
 *    when RxThreshold = 0, the threshold is exceeded when there is at least one entry in the receive
 *    FIFO. An interrupt can be generated when the RxThreshold has been reached, but has no effect
 *    on DMA requests, which are generated whenever the receiver FIFO is not empty.
 */
#define VFIFO_SPI_CFGSPI_RXTHRESHOLD(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_RXTHRESHOLD_SHIFT)) & VFIFO_SPI_CFGSPI_RXTHRESHOLD_MASK)

#define VFIFO_SPI_CFGSPI_TXTHRESHOLD_MASK        (0xFF000000U)
#define VFIFO_SPI_CFGSPI_TXTHRESHOLD_SHIFT       (24U)
/*! TXTHRESHOLD - Transmit FIFO Threshold. The System FIFO indicates that the threshold has been
 *    reached when the number of free entries in the transmit FIFO is less than or equal to this value.
 *    For example, when TxThreshold = 0, the threshold is exceeded when there is at least one free
 *    entry in the transmit FIFO. An interrupt can be generated when the TxThreshold has been
 *    reached, but has no effect on DMA requests, which are generated whenever the transmit FIFO has any
 *    free entries.
 */
#define VFIFO_SPI_CFGSPI_TXTHRESHOLD(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_TXTHRESHOLD_SHIFT)) & VFIFO_SPI_CFGSPI_TXTHRESHOLD_MASK)
/*! @} */

/* The count of VFIFO_SPI_CFGSPI */
#define VFIFO_SPI_CFGSPI_COUNT                   (2U)

/*! @name SPI_STATSPI - SPI0 status */
/*! @{ */

#define VFIFO_SPI_STATSPI_RXTH_MASK              (0x1U)
#define VFIFO_SPI_STATSPI_RXTH_SHIFT             (0U)
/*! RXTH - Receive FIFO Threshold. When 1, the receive FIFO threshold has been reached. This is a read-only bit. */
#define VFIFO_SPI_STATSPI_RXTH(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_RXTH_SHIFT)) & VFIFO_SPI_STATSPI_RXTH_MASK)

#define VFIFO_SPI_STATSPI_TXTH_MASK              (0x2U)
#define VFIFO_SPI_STATSPI_TXTH_SHIFT             (1U)
/*! TXTH - Transmit FIFO Threshold. When 1, the transmit FIFO threshold has been reached. This is a read-only bit. */
#define VFIFO_SPI_STATSPI_TXTH(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_TXTH_SHIFT)) & VFIFO_SPI_STATSPI_TXTH_MASK)

#define VFIFO_SPI_STATSPI_RXTIMEOUT_MASK         (0x10U)
#define VFIFO_SPI_STATSPI_RXTIMEOUT_SHIFT        (4U)
/*! RXTIMEOUT - Receive FIFO Timeout. When 1, the receive FIFO has timed out, based on the timeout
 *    configuration in the CFGSPI register. The timeout condition can be cleared by writing a 1 to
 *    this bit, by enabling or disabling the timeout interrupt, or by writing a 1 to the timeout
 *    interrupt enable.
 */
#define VFIFO_SPI_STATSPI_RXTIMEOUT(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_RXTIMEOUT_SHIFT)) & VFIFO_SPI_STATSPI_RXTIMEOUT_MASK)

#define VFIFO_SPI_STATSPI_BUSERR_MASK            (0x80U)
#define VFIFO_SPI_STATSPI_BUSERR_SHIFT           (7U)
/*! BUSERR - Bus Error. When 1, a bus error has occurred while processing data for SPI. The bus
 *    error flag can be cleared by writing a 1 to this bit.
 */
#define VFIFO_SPI_STATSPI_BUSERR(x)              (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_BUSERR_SHIFT)) & VFIFO_SPI_STATSPI_BUSERR_MASK)

