zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC54000/periph4/PERI_VFIFO.h
#define VFIFO_SPI_STATSPI_RXEMPTY_MASK           (0x100U)
#define VFIFO_SPI_STATSPI_RXEMPTY_SHIFT          (8U)
/*! RXEMPTY - Receive FIFO Empty. When 1, the receive FIFO is currently empty. This is a read-only bit. */
#define VFIFO_SPI_STATSPI_RXEMPTY(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_RXEMPTY_SHIFT)) & VFIFO_SPI_STATSPI_RXEMPTY_MASK)

#define VFIFO_SPI_STATSPI_TXEMPTY_MASK           (0x200U)
#define VFIFO_SPI_STATSPI_TXEMPTY_SHIFT          (9U)
/*! TXEMPTY - Transmit FIFO Empty. When 1, the transmit FIFO is currently empty. This is a read-only bit. */
#define VFIFO_SPI_STATSPI_TXEMPTY(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_TXEMPTY_SHIFT)) & VFIFO_SPI_STATSPI_TXEMPTY_MASK)

#define VFIFO_SPI_STATSPI_RXCOUNT_MASK           (0xFF0000U)
#define VFIFO_SPI_STATSPI_RXCOUNT_SHIFT          (16U)
/*! RXCOUNT - Receive FIFO Count. Indicates how many entries may be read from the receive FIFO. 0 =
 *    FIFO empty. This is a read-only field.
 */
#define VFIFO_SPI_STATSPI_RXCOUNT(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_RXCOUNT_SHIFT)) & VFIFO_SPI_STATSPI_RXCOUNT_MASK)

#define VFIFO_SPI_STATSPI_TXCOUNT_MASK           (0xFF000000U)
#define VFIFO_SPI_STATSPI_TXCOUNT_SHIFT          (24U)
/*! TXCOUNT - Transmit FIFO Count. Indicates how many entries may be written to the transmit FIFO. 0
 *    = FIFO full. This is a read-only field that is valid only when the TxFIFO is fully configured
 *    and enabled.
 */
#define VFIFO_SPI_STATSPI_TXCOUNT(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_TXCOUNT_SHIFT)) & VFIFO_SPI_STATSPI_TXCOUNT_MASK)
/*! @} */

/* The count of VFIFO_SPI_STATSPI */
#define VFIFO_SPI_STATSPI_COUNT                  (2U)

/*! @name SPI_INTSTATSPI - SPI0 interrupt status */
/*! @{ */

#define VFIFO_SPI_INTSTATSPI_RXTH_MASK           (0x1U)
#define VFIFO_SPI_INTSTATSPI_RXTH_SHIFT          (0U)
/*! RXTH - Receive FIFO Threshold. When 1, the receive FIFO threshold has been reached, and the related interrupt is enabled. */
#define VFIFO_SPI_INTSTATSPI_RXTH(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_RXTH_SHIFT)) & VFIFO_SPI_INTSTATSPI_RXTH_MASK)

#define VFIFO_SPI_INTSTATSPI_TXTH_MASK           (0x2U)
#define VFIFO_SPI_INTSTATSPI_TXTH_SHIFT          (1U)
/*! TXTH - Transmit FIFO Threshold. When 1, the transmit FIFO threshold has been reached, and the related interrupt is enabled. */
#define VFIFO_SPI_INTSTATSPI_TXTH(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_TXTH_SHIFT)) & VFIFO_SPI_INTSTATSPI_TXTH_MASK)

#define VFIFO_SPI_INTSTATSPI_RXTIMEOUT_MASK      (0x10U)
#define VFIFO_SPI_INTSTATSPI_RXTIMEOUT_SHIFT     (4U)
/*! RXTIMEOUT - Receive Timeout. When 1, the receive FIFO has timed out, based on the timeout
 *    configuration in the CFGSPI register, and the related interrupt is enabled.
 */
#define VFIFO_SPI_INTSTATSPI_RXTIMEOUT(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_RXTIMEOUT_SHIFT)) & VFIFO_SPI_INTSTATSPI_RXTIMEOUT_MASK)

#define VFIFO_SPI_INTSTATSPI_BUSERR_MASK         (0x80U)
#define VFIFO_SPI_INTSTATSPI_BUSERR_SHIFT        (7U)
/*! BUSERR - Bus Error. This is simply a copy of the same bit in the STATSPI register. The bus error interrupt is always enabled. */
#define VFIFO_SPI_INTSTATSPI_BUSERR(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_BUSERR_SHIFT)) & VFIFO_SPI_INTSTATSPI_BUSERR_MASK)

#define VFIFO_SPI_INTSTATSPI_RXEMPTY_MASK        (0x100U)
#define VFIFO_SPI_INTSTATSPI_RXEMPTY_SHIFT       (8U)
/*! RXEMPTY - Receive FIFO Empty. This is simply a copy of the same bit in the STATSPI register. */
#define VFIFO_SPI_INTSTATSPI_RXEMPTY(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_RXEMPTY_SHIFT)) & VFIFO_SPI_INTSTATSPI_RXEMPTY_MASK)

#define VFIFO_SPI_INTSTATSPI_TXEMPTY_MASK        (0x200U)
#define VFIFO_SPI_INTSTATSPI_TXEMPTY_SHIFT       (9U)
/*! TXEMPTY - Transmit FIFO Empty. This is simply a copy of the same bit in the STATSPI register. */
#define VFIFO_SPI_INTSTATSPI_TXEMPTY(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_TXEMPTY_SHIFT)) & VFIFO_SPI_INTSTATSPI_TXEMPTY_MASK)

#define VFIFO_SPI_INTSTATSPI_RXCOUNT_MASK        (0xFF0000U)
#define VFIFO_SPI_INTSTATSPI_RXCOUNT_SHIFT       (16U)
/*! RXCOUNT - Receive FIFO Count. This is simply a copy of the same field in the STATSPI register,
 *    included here so an ISR can read all needed status information in one read.
 */
#define VFIFO_SPI_INTSTATSPI_RXCOUNT(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_RXCOUNT_SHIFT)) & VFIFO_SPI_INTSTATSPI_RXCOUNT_MASK)

#define VFIFO_SPI_INTSTATSPI_TXCOUNT_MASK        (0xFF000000U)
#define VFIFO_SPI_INTSTATSPI_TXCOUNT_SHIFT       (24U)
/*! TXCOUNT - Transmit FIFO Available. This is simply a copy of the same field in the STATSPI
 *    register, included here so an ISR can read all needed status information in one read.
 */
#define VFIFO_SPI_INTSTATSPI_TXCOUNT(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_TXCOUNT_SHIFT)) & VFIFO_SPI_INTSTATSPI_TXCOUNT_MASK)
/*! @} */

/* The count of VFIFO_SPI_INTSTATSPI */
#define VFIFO_SPI_INTSTATSPI_COUNT               (2U)

/*! @name SPI_CTLSETSPI - SPI0 control read and set register. A complete value may be read from this register. Writing a 1 to any implemented bit position causes that bit to be set. */
/*! @{ */

#define VFIFO_SPI_CTLSETSPI_RXTHINTEN_MASK       (0x1U)
#define VFIFO_SPI_CTLSETSPI_RXTHINTEN_SHIFT      (0U)
/*! RXTHINTEN - Receive FIFO Threshold Interrupt Enable. */
#define VFIFO_SPI_CTLSETSPI_RXTHINTEN(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLSETSPI_RXTHINTEN_SHIFT)) & VFIFO_SPI_CTLSETSPI_RXTHINTEN_MASK)

#define VFIFO_SPI_CTLSETSPI_TXTHINTEN_MASK       (0x2U)
#define VFIFO_SPI_CTLSETSPI_TXTHINTEN_SHIFT      (1U)
/*! TXTHINTEN - Transmit FIFO Threshold Interrupt Enable. */
#define VFIFO_SPI_CTLSETSPI_TXTHINTEN(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLSETSPI_TXTHINTEN_SHIFT)) & VFIFO_SPI_CTLSETSPI_TXTHINTEN_MASK)

#define VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN_MASK  (0x10U)
#define VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN_SHIFT (4U)
/*! RXTIMEOUTINTEN - Receive FIFO Timeout Interrupt Enable. When enabled, this also enables the
 *    timeout for this SPI. Writing a 1 to this bit resets the SPI timeout logic.
 */
#define VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN_SHIFT)) & VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN_MASK)

#define VFIFO_SPI_CTLSETSPI_RXFLUSH_MASK         (0x100U)
#define VFIFO_SPI_CTLSETSPI_RXFLUSH_SHIFT        (8U)
/*! RXFLUSH - Receive FIFO flush. Writing a 1 to this bit forces the receive FIFO to be empty. */
#define VFIFO_SPI_CTLSETSPI_RXFLUSH(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLSETSPI_RXFLUSH_SHIFT)) & VFIFO_SPI_CTLSETSPI_RXFLUSH_MASK)

