zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC54000/periph4/PERI_VFIFO.h
#define VFIFO_SPI_CTLSETSPI_TXFLUSH_MASK         (0x200U)
#define VFIFO_SPI_CTLSETSPI_TXFLUSH_SHIFT        (9U)
/*! TXFLUSH - Transmit FIFO flush. Writing a 1 to this bit forces the transmit FIFO to be empty. */
#define VFIFO_SPI_CTLSETSPI_TXFLUSH(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLSETSPI_TXFLUSH_SHIFT)) & VFIFO_SPI_CTLSETSPI_TXFLUSH_MASK)
/*! @} */

/* The count of VFIFO_SPI_CTLSETSPI */
#define VFIFO_SPI_CTLSETSPI_COUNT                (2U)

/*! @name SPI_CTLCLRSPI - SPI0 control clear register. Writing a 1 to any implemented bit position causes the corresponding bit in the related CTLSET register to be cleared. */
/*! @{ */

#define VFIFO_SPI_CTLCLRSPI_RXTHINTCLR_MASK      (0x1U)
#define VFIFO_SPI_CTLCLRSPI_RXTHINTCLR_SHIFT     (0U)
/*! RXTHINTCLR - Receive FIFO Threshold Interrupt clear. */
#define VFIFO_SPI_CTLCLRSPI_RXTHINTCLR(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLCLRSPI_RXTHINTCLR_SHIFT)) & VFIFO_SPI_CTLCLRSPI_RXTHINTCLR_MASK)

#define VFIFO_SPI_CTLCLRSPI_TXTHINTCLR_MASK      (0x2U)
#define VFIFO_SPI_CTLCLRSPI_TXTHINTCLR_SHIFT     (1U)
/*! TXTHINTCLR - Transmit FIFO Threshold Interrupt clear. */
#define VFIFO_SPI_CTLCLRSPI_TXTHINTCLR(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLCLRSPI_TXTHINTCLR_SHIFT)) & VFIFO_SPI_CTLCLRSPI_TXTHINTCLR_MASK)

#define VFIFO_SPI_CTLCLRSPI_RXTIMEOUTINTCLR_MASK (0x10U)
#define VFIFO_SPI_CTLCLRSPI_RXTIMEOUTINTCLR_SHIFT (4U)
/*! RXTIMEOUTINTCLR - Receive FIFO Timeout Interrupt clear. */
#define VFIFO_SPI_CTLCLRSPI_RXTIMEOUTINTCLR(x)   (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLCLRSPI_RXTIMEOUTINTCLR_SHIFT)) & VFIFO_SPI_CTLCLRSPI_RXTIMEOUTINTCLR_MASK)

#define VFIFO_SPI_CTLCLRSPI_RXFLUSHCLR_MASK      (0x100U)
#define VFIFO_SPI_CTLCLRSPI_RXFLUSHCLR_SHIFT     (8U)
/*! RXFLUSHCLR - Receive FIFO flush clear. do the clear bits 8 and 9 do anything? */
#define VFIFO_SPI_CTLCLRSPI_RXFLUSHCLR(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLCLRSPI_RXFLUSHCLR_SHIFT)) & VFIFO_SPI_CTLCLRSPI_RXFLUSHCLR_MASK)

#define VFIFO_SPI_CTLCLRSPI_TXFLUSHCLR_MASK      (0x200U)
#define VFIFO_SPI_CTLCLRSPI_TXFLUSHCLR_SHIFT     (9U)
/*! TXFLUSHCLR - Transmit FIFO flush clear. */
#define VFIFO_SPI_CTLCLRSPI_TXFLUSHCLR(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLCLRSPI_TXFLUSHCLR_SHIFT)) & VFIFO_SPI_CTLCLRSPI_TXFLUSHCLR_MASK)
/*! @} */

/* The count of VFIFO_SPI_CTLCLRSPI */
#define VFIFO_SPI_CTLCLRSPI_COUNT                (2U)

/*! @name SPI_RXDATSPI - SPI0 received data. These registers are half word addressable. */
/*! @{ */

#define VFIFO_SPI_RXDATSPI_RXDAT_MASK            (0xFFFFU)
#define VFIFO_SPI_RXDATSPI_RXDAT_SHIFT           (0U)
/*! RXDAT - Receiver Data. This contains the next piece of received data. The number of bits that
 *    are used depends on the LEN setting in TXCTL / TXDATCTL.
 */
#define VFIFO_SPI_RXDATSPI_RXDAT(x)              (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_RXDAT_SHIFT)) & VFIFO_SPI_RXDATSPI_RXDAT_MASK)

#define VFIFO_SPI_RXDATSPI_RXSSEL0_N_MASK        (0x10000U)
#define VFIFO_SPI_RXDATSPI_RXSSEL0_N_SHIFT       (16U)
/*! RXSSEL0_N - Slave Select for receive. This field allows the state of the SSEL0 pin to be saved
 *    along with received data. The value will reflect the SSEL0 pin for both master and slave
 *    operation. A zero indicates that a slave select is active. The actual polarity of each slave select
 *    pin is configured by the related SPOL bit in CFG.
 */
#define VFIFO_SPI_RXDATSPI_RXSSEL0_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_RXSSEL0_N_SHIFT)) & VFIFO_SPI_RXDATSPI_RXSSEL0_N_MASK)

#define VFIFO_SPI_RXDATSPI_RXSSEL1_N_MASK        (0x20000U)
#define VFIFO_SPI_RXDATSPI_RXSSEL1_N_SHIFT       (17U)
/*! RXSSEL1_N - Slave Select for receive. This field allows the state of the SSEL1 pin to be saved
 *    along with received data. The value will reflect the SSEL1 pin for both master and slave
 *    operation. A zero indicates that a slave select is active. The actual polarity of each slave select
 *    pin is configured by the related SPOL bit in CFG.
 */
#define VFIFO_SPI_RXDATSPI_RXSSEL1_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_RXSSEL1_N_SHIFT)) & VFIFO_SPI_RXDATSPI_RXSSEL1_N_MASK)

#define VFIFO_SPI_RXDATSPI_RXSSEL2_N_MASK        (0x40000U)
#define VFIFO_SPI_RXDATSPI_RXSSEL2_N_SHIFT       (18U)
/*! RXSSEL2_N - Slave Select for receive. This field allows the state of the SSEL2 pin to be saved
 *    along with received data. The value will reflect the SSEL2 pin for both master and slave
 *    operation. A zero indicates that a slave select is active. The actual polarity of each slave select
 *    pin is configured by the related SPOL bit in CFG.
 */
#define VFIFO_SPI_RXDATSPI_RXSSEL2_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_RXSSEL2_N_SHIFT)) & VFIFO_SPI_RXDATSPI_RXSSEL2_N_MASK)

#define VFIFO_SPI_RXDATSPI_RXSSEL3_N_MASK        (0x80000U)
#define VFIFO_SPI_RXDATSPI_RXSSEL3_N_SHIFT       (19U)
/*! RXSSEL3_N - Slave Select for receive. This field allows the state of the SSEL3 pin to be saved
 *    along with received data. The value will reflect the SSEL3 pin for both master and slave
 *    operation. A zero indicates that a slave select is active. The actual polarity of each slave select
 *    pin is configured by the related SPOL bit in CFG.
 */
#define VFIFO_SPI_RXDATSPI_RXSSEL3_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_RXSSEL3_N_SHIFT)) & VFIFO_SPI_RXDATSPI_RXSSEL3_N_MASK)

#define VFIFO_SPI_RXDATSPI_SOT_MASK              (0x100000U)
#define VFIFO_SPI_RXDATSPI_SOT_SHIFT             (20U)
/*! SOT - Start of Transfer flag. This flag will be 1 if this is the first data after the SSELs went
 *    from deasserted to asserted (i.e., any previous transfer has ended). This information can be
 *    used to identify the first piece of data in cases where the transfer length is greater than 16
 *    bit.
 */
#define VFIFO_SPI_RXDATSPI_SOT(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_SOT_SHIFT)) & VFIFO_SPI_RXDATSPI_SOT_MASK)
/*! @} */

/* The count of VFIFO_SPI_RXDATSPI */
#define VFIFO_SPI_RXDATSPI_COUNT                 (2U)

/*! @name SPI_TXDATSPI - SPI0 transmit data. These registers are half word addressable. */
/*! @{ */

#define VFIFO_SPI_TXDATSPI_TXDAT_MASK            (0xFFFFU)
#define VFIFO_SPI_TXDATSPI_TXDAT_SHIFT           (0U)
/*! TXDAT - Transmit Data. This field provides from 1 to 16 bits of data to be transmitted. */
#define VFIFO_SPI_TXDATSPI_TXDAT(x)              (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_TXDAT_SHIFT)) & VFIFO_SPI_TXDATSPI_TXDAT_MASK)

#define VFIFO_SPI_TXDATSPI_TXSSEL0_N_MASK        (0x10000U)
#define VFIFO_SPI_TXDATSPI_TXSSEL0_N_SHIFT       (16U)
/*! TXSSEL0_N - Transmit Slave Select. This field asserts SSEL0 in master mode. The output on the
 *    pin is active LOW by default. The active state of the SSEL0 pin is configured by bits in the CFG
 *    register.
 *  0b0..Asserted. SSEL0 asserted.
 *  0b1..Not asserted. SSEL0 not asserted.
 */
#define VFIFO_SPI_TXDATSPI_TXSSEL0_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_TXSSEL0_N_SHIFT)) & VFIFO_SPI_TXDATSPI_TXSSEL0_N_MASK)

#define VFIFO_SPI_TXDATSPI_TXSSEL1_N_MASK        (0x20000U)
#define VFIFO_SPI_TXDATSPI_TXSSEL1_N_SHIFT       (17U)
/*! TXSSEL1_N - Transmit Slave Select. This field asserts SSEL1 in master mode. The output on the
 *    pin is active LOW by default. The active state of the SSEL1 pin is configured by bits in the CFG
 *    register.
 *  0b0..Asserted. SSEL1 asserted.
 *  0b1..Not asserted. SSEL1 not asserted.
 */
#define VFIFO_SPI_TXDATSPI_TXSSEL1_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_TXSSEL1_N_SHIFT)) & VFIFO_SPI_TXDATSPI_TXSSEL1_N_MASK)

#define VFIFO_SPI_TXDATSPI_TXSSEL2_N_MASK        (0x40000U)
#define VFIFO_SPI_TXDATSPI_TXSSEL2_N_SHIFT       (18U)
/*! TXSSEL2_N - Transmit Slave Select. This field asserts SSEL2 in master mode. The output on the
 *    pin is active LOW by default. The active state of the SSEL2 pin is configured by bits in the CFG
 *    register.
 *  0b0..Asserted. SSEL2 asserted.
 *  0b1..Not asserted. SSEL2 not asserted.
 */
#define VFIFO_SPI_TXDATSPI_TXSSEL2_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_TXSSEL2_N_SHIFT)) & VFIFO_SPI_TXDATSPI_TXSSEL2_N_MASK)

