zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC54000/periph4/PERI_VFIFO.h
#define VFIFO_SPI_TXDATSPI_TXSSEL3_N_MASK        (0x80000U)
#define VFIFO_SPI_TXDATSPI_TXSSEL3_N_SHIFT       (19U)
/*! TXSSEL3_N - Transmit Slave Select. This field asserts SSEL3 in master mode. The output on the
 *    pin is active LOW by default. The active state of the SSEL3 pin is configured by bits in the CFG
 *    register.
 *  0b0..Asserted. SSEL3 asserted.
 *  0b1..Not asserted. SSEL3 not asserted.
 */
#define VFIFO_SPI_TXDATSPI_TXSSEL3_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_TXSSEL3_N_SHIFT)) & VFIFO_SPI_TXDATSPI_TXSSEL3_N_MASK)

#define VFIFO_SPI_TXDATSPI_EOT_MASK              (0x100000U)
#define VFIFO_SPI_TXDATSPI_EOT_SHIFT             (20U)
/*! EOT - End of Transfer. The asserted SSEL will be deasserted at the end of a transfer, and remain
 *    so for at least the time specified by the Transfer_delay value in the DLY register.
 *  0b0..Not deasserted. SSEL not deasserted. This piece of data is not treated as the end of a transfer. SSEL
 *       will not be deasserted at the end of this data.
 *  0b1..Deasserted. SSEL deasserted. This piece of data is treated as the end of a transfer. SSEL will be
 *       deasserted at the end of this piece of data.
 */
#define VFIFO_SPI_TXDATSPI_EOT(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_EOT_SHIFT)) & VFIFO_SPI_TXDATSPI_EOT_MASK)

#define VFIFO_SPI_TXDATSPI_EOF_MASK              (0x200000U)
#define VFIFO_SPI_TXDATSPI_EOF_SHIFT             (21U)
/*! EOF - End of Frame. Between frames, a delay may be inserted, as defined by the FRAME_DELAY value
 *    in the DLY register. The end of a frame may not be particularly meaningful if the FRAME_DELAY
 *    value = 0. This control can be used as part of the support for frame lengths greater than 16
 *    bits.
 *  0b0..Data not EOF. This piece of data transmitted is not treated as the end of a frame.
 *  0b1..Data EOF. This piece of data is treated as the end of a frame, causing the FRAME_DELAY time to be
 *       inserted before subsequent data is transmitted.
 */
#define VFIFO_SPI_TXDATSPI_EOF(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_EOF_SHIFT)) & VFIFO_SPI_TXDATSPI_EOF_MASK)

#define VFIFO_SPI_TXDATSPI_RXIGNORE_MASK         (0x400000U)
#define VFIFO_SPI_TXDATSPI_RXIGNORE_SHIFT        (22U)
/*! RXIGNORE - Receive Ignore. This allows data to be transmitted using the SPI without the need to
 *    read unneeded data from the receiver to simplify the transmit process and can be used with the
 *    DMA.
 *  0b0..Read received data. Received data must be read in order to allow transmission to progress. In slave mode,
 *       an overrun error will occur if received data is not read before new data is received.
 *  0b1..Ignore received data. Received data is ignored, allowing transmission without reading unneeded received
 *       data. No receiver flags are generated.
 */
#define VFIFO_SPI_TXDATSPI_RXIGNORE(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_RXIGNORE_SHIFT)) & VFIFO_SPI_TXDATSPI_RXIGNORE_MASK)

#define VFIFO_SPI_TXDATSPI_LEN_MASK              (0xF000000U)
#define VFIFO_SPI_TXDATSPI_LEN_SHIFT             (24U)
/*! LEN - Data Length. Specifies the data length from 1 to 16 bits. Note that transfer lengths
 *    greater than 16 bits are supported by implementing multiple sequential data transmits. 0x0 = Data
 *    transfer is 1 bit in length. 0x1 = Data transfer is 2 bits in length. 0x2 = Data transfer is 3
 *    bits in length. ... 0xF = Data transfer is 16 bits in length.
 */
#define VFIFO_SPI_TXDATSPI_LEN(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_LEN_SHIFT)) & VFIFO_SPI_TXDATSPI_LEN_MASK)
/*! @} */

/* The count of VFIFO_SPI_TXDATSPI */
#define VFIFO_SPI_TXDATSPI_COUNT                 (2U)


/*!
 * @}
 */ /* end of group VFIFO_Register_Masks */


/*!
 * @}
 */ /* end of group VFIFO_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* VFIFO_H_ */

